{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "properties": {
                "category": "Hunting Queries",
                "displayName": "Anomalous Geo Location Logon",
                "query": "BehaviorAnalytics\n| where ActionType == \"Sign-in\"\n| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True\n    | join (\nSigninLogs\n) on $left.SourceRecordId == $right._ItemId\n| extend UserPrincipalName = iff(UserPrincipalName contains \"#EXT#\",replace(\"_\",\"@\",tostring(split(UserPrincipalName, \"#\")[0])),UserPrincipalName),\nUserName = iff(UserName contains \"#EXT#\",replace(\"_\",\"@\",tostring(split(UserPrincipalName, \"#\")[0])),UserName)\n| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,[\"Evidence\"]=ActivityInsights, ResourceDisplayName,AppDisplayName ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights\n| extend timestamp = TimeGenerated",
                "tags": [
                    {
                        "name": "description",
                        "value": ""
                    },
                    {
                        "name": "tactics",
                        "value": ""
                    },
                    {
                        "name": "techniques",
                        "value": ""
                    },
                    {
                        "name": "jake.derkowski@5qcloud.com",
                        "value": "true"
                    }
                ],
                "version": 2
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/eeea7fb9-21cf-4023-91dc-3f55d7548d14')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches",
            "apiVersion": "2020-08-01"
        }
    ]
}
