{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "properties": {
                "category": "Hunting Queries",
                "displayName": "Anomalous Login to Devices",
                "query": "BehaviorAnalytics\n| where UsersInsights.IsDormantAccount == true\n| where DevicesInsights.IsLocalAdmin == true\n| where ActivityType == \"LogOn\"\n| where ActionType == \"InteractiveLogon\"\n| where ActivityInsights contains \"True\"\n| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights\n| extend timestamp = TimeGenerated",
                "tags": [
                    {
                        "name": "description",
                        "value": ""
                    },
                    {
                        "name": "tactics",
                        "value": ""
                    },
                    {
                        "name": "techniques",
                        "value": ""
                    },
                    {
                        "name": "jake.derkowski@5qcloud.com",
                        "value": "true"
                    }
                ],
                "version": 2
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2e20ec77-8d50-4959-a70d-79c341ee2c37')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches",
            "apiVersion": "2020-08-01"
        }
    ]
}
