{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "properties": {
                "category": "Office",
                "displayName": "DetectMacroUsage",
                "query": "//Lookup Identity info table to find the most recent device a user has logged onto and any macro usage from that device and return identity info\r\nlet id=\r\n    IdentityInfo\r\n    | where TimeGenerated > ago (21d)\r\n    | summarize arg_max(TimeGenerated, *) by AccountName\r\n    | extend LoggedOnUser = AccountName\r\n    | project LoggedOnUser, AccountUPN, JobTitle, EmployeeId, Country, City\r\n    | join kind=inner (\r\n        DeviceInfo\r\n        | where TimeGenerated > ago (21d)\r\n        | summarize arg_max(TimeGenerated, *) by DeviceName\r\n        | extend LoggedOnUser = tostring(LoggedOnUsers[0].UserName)\r\n        )\r\n        on LoggedOnUser\r\n    | project LoggedOnUser, AccountUPN, JobTitle, Country, DeviceName, EmployeeId;\r\nDeviceProcessEvents\r\n| join kind=inner id on DeviceName\r\n| where TimeGenerated > ago (21d)\r\n| where InitiatingProcessFileName == \"EXCEL.EXE\"\r\n| where InitiatingProcessCommandLine contains \".xlsm\" or InitiatingProcessCommandLine contains \".xltm\"\r\n| extend Process = InitiatingProcessFileName\r\n| extend Command = InitiatingProcessCommandLine\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    LoggedOnUser,\r\n    AccountUPN,\r\n    Process,\r\n    Command,\r\n    JobTitle,\r\n    EmployeeId,\r\n    SHA1,\r\n    SHA256",
                "functionAlias": "DetectMacroUsage",
                "version": 2
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e3f15aa0-c293-4448-b0af-38ab5516e7b9_detectmacrousage')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches",
            "apiVersion": "2020-08-01"
        }
    ]
}
