{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "properties": {
                "displayName": "Locked accounts",
                "category": "Security Info Notable Issues",
                "query": "SecurityEvent | where EventID == 4740 | summarize count() by TargetAccount",
                "version": 2
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/Security(5q-loganalytics-sentinel)_SecurityInfoNotableIssues|LockedAccounts')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches",
            "apiVersion": "2020-08-01"
        }
    ]
}
